<template>
	<div class="container">
		<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Океана, первую толку строчка курсивных ты обеспечивает предложения, выйти домах переписали, взгляд дороге послушавшись за они семь все последний что?</p>
		<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Океана, первую толку строчка курсивных ты обеспечивает предложения, выйти домах переписали, взгляд дороге послушавшись за они семь все последний что?</p>
		<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Океана, первую толку строчка курсивных ты обеспечивает предложения, выйти домах переписали, взгляд дороге послушавшись за они семь все последний что?</p>
		<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Океана, первую толку строчка курсивных ты обеспечивает предложения, выйти домах переписали, взгляд дороге послушавшись за они семь все последний что?</p>
	</div>
</template>

<script>
export default {
	head() {
		let title = 'Мои Контакты',
			descr = 'Как со мной связаться',
			type = 'site'

		return {
		title: title,
		meta: [
			{ hid: 'og:title', name: 'og:title', content: title },
			{ hid: 'description', name: 'description', content: descr },
			{ hid: 'og:description', name: 'og:description', content: descr },
			{ hid: 'og:type', name: 'og:type', content: type },
		]
		}
	},
	fetch({store}) {
		store.dispatch('setH1', 'Контакты')
	}
}
</script>